{
  "projectName": "Plano de Evolução da Matriz de Eisenhower",
  "version": "1.6-planning",
  "lastUpdated": "2025-09-26T16:06:00Z",
  "projectGoals": [
    "Aumentar a manutenibilidade e escalabilidade do código-fonte.",
    "Melhorar a produtividade do usuário através de novas funcionalidades e refinamentos de UX.",
    "Estabelecer uma arquitetura de software robusta para futuras expansões."
  ],
  "developmentStatus": {
    "workingMode": "Desenvolvimento iterativo e incremental, dividido em Fases e Epics. Cada passo de implementação é seguido pela entrega do código completo, versionamento com commits atômicos no Git e validação pelo usuário antes de prosseguir.",
    "summaryAndChallenges": "A Fase 1 de refatoração foi concluída com sucesso. A Fase 2 avançou significativamente, com a implementação de subtarefas e notificações. A Fase 2.5 foi criada para agrupar correções de bugs e refinamentos de UI/UX que surgiram após a implementação das novas features, demonstrando a importância do ciclo de feedback para a qualidade do produto final."
  },
  "phases": [
    {
      "phaseId": 1,
      "phaseName": "Fundação Modular (Refatoração Estrutural)",
      "status": "Concluído"
    },
    {
      "phaseId": 2,
      "phaseName": "Expansão da Produtividade (Novas Funcionalidades)",
      "status": "Concluído"
    },
    {
      "phaseId": "2.5",
      "phaseName": "Refinamento e Correção de Bugs",
      "status": "Concluído"
    },
    {
      "phaseId": 3,
      "phaseName": "Visão de Futuro (Funcionalidades Avançadas)",
      "objective": "Transformar a ferramenta em um ecossistema de produtividade completo e conectado.",
      "status": "Em Progresso",
      "prerequisites": [
        "Conclusão bem-sucedida das Fases 2 e 2.5"
      ],
      "epics": [
        {
          "epicName": "Feature: Exportar e Importar JSON",
          "status": "Concluído",
          "tasks": [
            {
              "task": "[FEAT] Implementar lógica de exportação e importação em um módulo de serviço de dados dedicado.",
              "status": "Concluído"
            },
            {
              "task": "[FIX] Corrigir bug que impedia a persistência de tarefas importadas no localStorage.",
              "status": "Concluído"
            }
          ]
        },
        {
          "epicName": "Feature: Estatísticas de Produtividade",
          "description": "Migrar a funcionalidade de estatísticas do app monolítico para a nova arquitetura modular.",
          "status": "Concluído"
        },
        {
          "epicName": "Feature: Arquivamento e Histórico",
          "description": "Permitir que usuários arquivem tarefas concluídas para manter a matriz limpa, com a opção de visualizar, restaurar ou excluir permanentemente o histórico. O backup via JSON será unificado para incluir tanto tarefas ativas quanto arquivadas, garantindo uma experiência de usuário segura e intuitiva.",
          "status": "Em Planejamento",
          "tasks": [
            {
              "task": "[ARQUITETURA] Criar um novo 'archive-service.js' dedicado para gerenciar o ciclo de vida das tarefas arquivadas (CRUD), mantendo a separação de responsabilidades.",
              "status": "Pendente"
            },
            {
              "task": "[UI] Preparar o 'index.html' com todos os novos elementos: botão 'Arquivar' nos cards, botão 'Ver Histórico' no menu, e um novo modal com template para a lista de arquivados.",
              "status": "Pendente"
            },
            {
              "task": "[REFACTOR] Aprimorar o 'data-service.js' para que a exportação gere um backup unificado (ativas + arquivadas) e a importação restaure ambos os estados.",
              "status": "Pendente"
            },
            {
              "task": "[ORQUESTRAÇÃO] Implementar no 'app.js' a lógica de arquivamento, que coordena a remoção da tarefa ativa ('task-service') e a adição ao histórico ('archive-service').",
              "status": "Pendente"
            },
            {
              "task": "[UI/LÓGICA] Implementar no 'ui-manager.js' e 'app.js' a visualização do modal de histórico e as ações de restaurar e excluir permanentemente, orquestrando as chamadas aos serviços correspondentes.",
              "status": "Pendente"
            }
          ]
        },
        {
          "epicName": "Feature: Integração com Google Agenda (via Link)",
          "description": "Permitir que o usuário envie uma tarefa com data de vencimento para o Google Agenda através de um link pré-formatado.",
          "status": "Pendente"
        }
      ]
    }
  ]
}