{
  "projectName": "Plano de Evolução da Matriz de Eisenhower",
  "version": "1.6.0",
  "lastUpdated": "2025-09-28T09:39:00Z",
  "projectMethodology": {
    "title": "Metodologia de Desenvolvimento Colaborativo e Incremental",
    "description": "Este projeto segue um processo de desenvolvimento iterativo e rigoroso, onde cada nova funcionalidade ou correção é tratada como um mini-projeto. O objetivo é garantir a máxima qualidade, controle e alinhamento a cada passo, priorizando a estabilidade do código existente sobre a implementação de novas features.",
    "corePrinciples": [
      {
        "principle": "Planejamento Detalhado e Colaborativo",
        "details": "Nenhuma implementação começa sem um plano detalhado. Eu proponho um plano dividido em passos lógicos, e você, o usuário, atua como arquiteto de software, revisando, questionando e aprovando as decisões de arquitetura (ex: a criação de novos serviços como 'data-service' e 'archive-service')."
      },
      {
        "principle": "Documentação 'As Code'",
        "details": "O Roadmap é a fonte da verdade. Antes de iniciar a codificação de uma nova feature, o plano detalhado é primeiro transcrito para este arquivo. A documentação não é um registro do que foi feito, mas um guia para o que será feito."
      },
      {
        "principle": "Desenvolvimento Orientado por Confirmação (Approval-Driven Development)",
        "details": "O desenvolvimento avança em um ritmo controlado por você. Eu forneço o código para um único passo do plano e aguardo sua confirmação explícita ('ok', 'prossiga', etc.) antes de avançar para o próximo. Isso garante revisão e controle contínuos."
      },
      {
        "principle": "Commits Atômicos",
        "details": "Cada passo do nosso plano corresponde a um único 'commit' no Git. Isso cria um histórico de alterações limpo, onde cada commit tem uma única e clara responsabilidade, facilitando a depuração e o rastreamento de mudanças."
      },
      {
        "principle": "Estabilidade Primeiro (Regression Handling)",
        "details": "Se uma funcionalidade existente quebrar (regressão), o desenvolvimento da nova feature é imediatamente pausado. Um novo plano de correção é criado e executado. Apenas após a confirmação da correção, o trabalho na nova funcionalidade é retomado."
      }
    ]
  },
  "projectGoals": [
    "Aumentar a manutenibilidade e escalabilidade do código-fonte.",
    "Melhorar a produtividade do usuário através de novas funcionalidades e refinamentos de UX.",
    "Estabelecer uma arquitetura de software robusta para futuras expansões."
  ],
  "phases": [
    {
      "phaseId": "2.5",
      "phaseName": "Refinamento e Correção de Bugs",
      "status": "Concluído",
      "epics": [
        {
          "epicName": "Correção de Regressões",
          "status": "Concluído",
          "tasks": [
            { "task": "[FIX] Restaurar a funcionalidade de arrastar e soltar (drag-and-drop) corrigindo o seletor de alvo do evento no ui-manager.", "status": "Concluído" }
          ]
        }
      ]
    },
    {
      "phaseId": 3,
      "phaseName": "Visão de Futuro (Funcionalidades Avançadas)",
      "status": "Concluído",
      "epics": [
        {
          "epicName": "Feature: Arquivamento e Histórico",
          "description": "Permitir que usuários arquivem tarefas concluídas para manter a matriz limpa, com a opção de visualizar, restaurar ou excluir permanentemente o histórico. O backup via JSON foi unificado para incluir tanto tarefas ativas quanto arquivadas.",
          "status": "Concluído"
        }
      ]
    },
    {
      "phaseId": "3.1",
      "phaseName": "Refinamento e Correção Pós-Fase 3",
      "status": "Concluído",
      "epics": [
        {
          "epicName": "Correção da Experiência do Usuário (UX)",
          "status": "Concluído",
          "tasks": [
            { "task": "[FIX] Corrigir o fluxo de adição de subtarefas, implementando o fechamento do formulário com 'Escape' e clique externo.", "status": "Concluído" },
            { "task": "[FIX] Resolver o bug de visibilidade que impedia o botão 'Adicionar subtarefa' de reaparecer corretamente.", "status": "Concluído" },
            { "task": "[STYLE] Refinar a estética do formulário de subtarefas para alinhá-lo com o design system da aplicação.", "status": "Concluído" }
          ]
        }
      ]
    },
    {
      "phaseId": 4,
      "phaseName": "Gestão de Projetos de Longo Prazo",
      "objective": "Evoluir de uma ferramenta de gerenciamento de tarefas para um sistema de gestão de objetivos, separando o planejamento de longo prazo da execução diária.",
      "status": "Pendente",
      "epics": [
        {
          "epicName": "Módulo 'Projetos' (O Hangar)",
          "description": "Criar uma nova seção dedicada onde o usuário pode listar projetos de longo prazo e fazer brainstorming de todas as tarefas associadas, sem sobrecarregar a Matriz principal."
        },
        {
          "epicName": "Integração Matriz <-> Projetos (A Ponte)",
          "description": "Implementar a funcionalidade chave 'Enviar para a Matriz', permitindo que o usuário promova uma tarefa de um projeto para a matriz de execução no momento oportuno. A tarefa promovida carregará automaticamente uma tag de seu projeto de origem."
        },
        {
          "epicName": "Filtros Avançados por Tags",
          "description": "Permitir que a visualização da Matriz seja filtrada por uma ou mais tags de projeto, oferecendo uma visão clara do status de cada iniciativa."
        }
      ]
    },
    {
      "phaseId": 5,
      "phaseName": "Produtividade Proativa (O Assistente Inteligente)",
      "objective": "Transformar o aplicativo de uma ferramenta passiva para um assistente ativo que ajuda o usuário a manter o 'momentum' e combater a procrastinação.",
      "status": "Pendente",
      "epics": [
        {
          "epicName": "Fundação de Dados Temporais",
          "description": "Enriquecer os modelos de dados de tarefas e projetos com timestamps 'createdAt' e 'lastModifiedAt' para permitir o rastreamento da inatividade."
        },
        {
          "epicName": "Indicadores Visuais de 'Frescor'",
          "description": "Implementar um sistema de feedback visual sutil (ex: bordas coloridas) que indica há quanto tempo uma tarefa ou projeto está inativo, servindo como um 'nudge' passivo."
        },
        {
          "epicName": "Módulo de 'Revisão Semanal'",
          "description": "Criar uma funcionalidade guiada que transforma a revisão semanal em um ritual, ajudando o usuário a celebrar vitórias, limpar tarefas estagnadas e planejar os próximos passos dos projetos."
        },
        {
          "epicName": "Análise de Momentum",
          "description": "Aprimorar a tela de 'Estatísticas' com um novo painel que identifica projetos parados e possíveis tarefas 'gargalo', fornecendo insights analíticos sobre o fluxo de trabalho."
        }
      ]
    }
  ]
}